## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bastion.azurerm_bastion_host.bastionhost will be created
  + resource "azurerm_bastion_host" "bastionhost" {
      + copy_paste_enabled        = true
      + dns_name                  = (known after apply)
      + file_copy_enabled         = false
      + id                        = (known after apply)
      + ip_connect_enabled        = false
      + kerberos_enabled          = false
      + location                  = "northeurope"
      + name                      = "aztf-hub-vnet-bastion"
      + resource_group_name       = "aztf-hub-rg"
      + scale_units               = 2
      + session_recording_enabled = false
      + shareable_link_enabled    = false
      + sku                       = "Basic"
      + tags                      = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + tunneling_enabled         = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }
    }

  # module.bastion.azurerm_public_ip.bastionhost will be created
  + resource "azurerm_public_ip" "bastionhost" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "aztf-hub-vnet-bastion-pip"
      + resource_group_name     = "aztf-hub-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.firewall.azurerm_firewall.firewall will be created
  + resource "azurerm_firewall" "firewall" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-hub-vnet-firewall"
      + resource_group_name = "aztf-hub-rg"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
      + threat_intel_mode   = "Deny"

      + ip_configuration {
          + name                 = "configuration"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "60m"
          + delete = "60m"
          + update = "60m"
        }
    }

  # module.firewall.azurerm_public_ip.firewall will be created
  + resource "azurerm_public_ip" "firewall" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "aztf-hub-vnet-firewall-pip"
      + resource_group_name     = "aztf-hub-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.firewall_rules.azurerm_firewall_policy.aks will be created
  + resource "azurerm_firewall_policy" "aks" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "aks-fwp"
      + resource_group_name      = "aztf-hub-rg"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + threat_intelligence_mode = "Alert"
    }

  # module.firewall_rules.azurerm_firewall_policy_rule_collection_group.AKS will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "AKS" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "aks-rcg"
      + priority           = 200

      + application_rule_collection {
          + action   = "Allow"
          + name     = "aks_app_rules"
          + priority = 205

          + rule {
              + destination_fqdn_tags = [
                  + "AzureKubnernetesService",
                ]
              + name                  = "aks_service"
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]

              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }

      + network_rule_collection {
          + action   = "Allow"
          + name     = "aks_network_rules"
          + priority = 201

          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "443",
                ]
              + name                  = "https"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "53",
                ]
              + name                  = "dns"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "123",
                ]
              + name                  = "time"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "1194",
                ]
              + name                  = "tunnel_udp"
              + protocols             = [
                  + "UDP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "9000",
                ]
              + name                  = "tunnel_tcp"
              + protocols             = [
                  + "TCP",
                ]
              + source_addresses      = [
                  + "10.1.0.0/16",
                ]
            }
        }
    }

  # module.hub_networking.azurerm_network_security_group.nsgs["DevSubnet"] will be created
  + resource "azurerm_network_security_group" "nsgs" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "DevSubnet-nsg"
      + resource_group_name = "aztf-hub-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.hub_networking.azurerm_network_security_group.nsgs["InfraSubnet"] will be created
  + resource "azurerm_network_security_group" "nsgs" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "InfraSubnet-nsg"
      + resource_group_name = "aztf-hub-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.hub_networking.azurerm_resource_group.hub_rg will be created
  + resource "azurerm_resource_group" "hub_rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "aztf-hub-rg"
      + tags     = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.3.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.1.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["DevSubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.5.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "DevSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.2.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet.hub_subnets["InfraSubnet"] will be created
  + resource "azurerm_subnet" "hub_subnets" {
      + address_prefixes                              = [
          + "10.0.4.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "InfraSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "aztf-hub-rg"
      + virtual_network_name                          = "aztf-hub-vnet"
    }

  # module.hub_networking.azurerm_subnet_network_security_group_association.nsg_associations["DevSubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_associations" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub_networking.azurerm_subnet_network_security_group_association.nsg_associations["InfraSubnet"] will be created
  + resource "azurerm_subnet_network_security_group_association" "nsg_associations" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.hub_networking.azurerm_virtual_network.hub_vnet will be created
  + resource "azurerm_virtual_network" "hub_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "aztf-hub-vnet"
      + resource_group_name = "aztf-hub-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "Owner"       = "kmiszel"
          + "Source"      = "Terraform"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hub_rg_name   = "aztf-hub-rg"
  + hub_vnet_id   = (known after apply)
  + hub_vnet_name = "aztf-hub-vnet"
```
</details>